fast_finish_2026/LR7/webapp/runs/smoke-2026-09-13T00-00-01Z/case/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultValues
{
    U       (0 0 0);
    T       742.123323;
    p       9000;
}

zones
{
    inletPlenum
    {
        type        box;

        box         (-2 -1 -1) (0 1 1);

        values
        {
            T       1800;
            p       200000;
        }
    }
}


// ************************************************************************* //
